/* 18. Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y 
В переводе на язык программирование это выражение примет вид !(X && Y) = !X || !Y
----------------------------------------------------------- Не (X и Y) = НеX или НеY
и таблица истинности делаем
                                X   Y   R (результат)
                                0   0   1
                                0   1   1

*/
bool[] x = { false, true };
bool[] y = { false, true };

for (int i = 0; i < 2; i++)
{
    for (int j = 0; j < 2; j++)
    {
        if (!(x[i] && y[i]) != (!x[i] || !y[i]))
        {
            Console.WriteLine("Есть несовпадения");
        }
        else
        {
             Console.WriteLine($"!({x[i]} && {y[j]}) == !{x[i]} || !{y[i]}");
        }
    }
}